import pandas as pd

data = {
    'Ученик': ['Алиса', 'Боб', 'Вера', 'Глеб', 'Дарья', 'Евгений', 'Жанна', 'Зинаида', 'Иван', 'Ксения'],
    'Математика': [4, 5, 3, 4, 5, 3, 4, 2, 5, 4],
    'Физика': [3, 4, 3, 5, 4, 2, 3, 4, 5, 3],
    'Информатика': [5, 4, 5, 3, 4, 5, 4, 3, 5, 4],
    'История': [4, 3, 4, 5, 3, 4, 5, 4, 3, 4],
    'Литература': [5, 4, 5, 3, 4, 5, 4, 3, 5, 4]
}

df = pd.DataFrame(data)

print(df)

print(f"Средния оценка Математика - {df['Математика'].mean()}")
print(f"Средния оценка Физика - {df['Физика'].mean()}")
print(f"Средния оценка Информатика - {df['Информатика'].mean()}")
print(f"Средния оценка История - {df['История'].mean()}")
print(f"Средния оценка Литература - {df['Литература'].mean()}")

print(f"Медианная по Математике  - {df['Математика'].median()}")
print(f"Медианная по Физике - {df['Физика'].median()}")
print(f"Медианная по Информатике  - {df['Информатика'].median()}")
print(f"Медианная по Истории  - {df['История'].median()}")
print(f"Медианная по Литературе  - {df['Литература'].median()}")

print(f"Стандартное отклонение Математика  - {df['Математика'].std()}")
print(f"Стандартное отклонение Физика  - {df['Физика'].std()}")
print(f"Стандартное отклонение Информатика - {df['Информатика'].std()}")
print(f"Стандартное отклонение История  - {df['История'].std()}")
print(f"Стандартное отклонение Литература  - {df['Литература'].std()}")


print(f"Q1 pавно:  {df['Математика'].quantile(0.25)}")
print(f"Q3 pавно:  {df['Математика'].quantile(0.75)}")

Q1 = df['Математика'].quantile(0.25)
Q3 = df['Математика'].quantile(0.75)

print(f"IQR pавно: {Q3-Q1}" )




